In [1]:
import pandas as pd
import numpy as np

item_name = ["Keyboard","Doll","Iphone 28 Pro Max"]
catagory = ["IT Computing","Toy","Mobile"]
price = [500,35000,800000]
cols = ['Item Name','Categories',"Pricre"]

data = [
    {'item_name':"Keyboard","category":"IT Computing","price":500},
    {'item_name':"Doll","category":"Toy","price":35000},
    {'item_name':"Iphone 28 Pro Max","category":"Mobile","price":800000}
]

# key = column name
# value = item in column

In [2]:
df = pd.DataFrame(data);df

           item_name      category   price
0           Keyboard  IT Computing     500
1               Doll           Toy   35000
2  Iphone 28 Pro Max        Mobile  800000

In [23]:
df.set_index(["item_name"])  
df# แทนที่ column แรก ด้วย item_name column

           item_name      catagory   price
0           Keyboard  IT Computing     500
1               Doll           Toy   35000
2  Iphone 28 Pro Max        Mobile  800000

In [18]:
df.set_index(["catagory"], inplace=True);df 
# แทนที่ column แรก ด้วย catagory column แบบถาวระ
# inplace=True เป็นการลงข้อมูลทับแบบถาวรว

                      item_name   price
catagory
IT Computing           Keyboard     500
Toy                        Doll   35000
Mobile        Iphone 28 Pro Max  800000